code/city/app/controllers/city_controller.rb

  def get_population
    cityname= params[:name]
    c=Town.find_by_name(cityname)
---
SELECT "towns".* FROM "towns" WHERE "towns"."name" = 'Oakland' LIMIT 1

  def get_mayor
    cityname= params[:name]

    c=Town.find_by_name(cityname)
---
SELECT "towns".* FROM "towns" WHERE "towns"."name" = 'SFO' LIMIT 1

  def edit_mayor
    if params[:cityname]
      @town=Town.find_by_name params[:cityname]
      @mayor = @town.mayor
    else
      c=Town.find params[:city][:id]
      puts ">>> #{params}"

      if !c.mayor
        m = Mayor.new

        m.save
        c.mayor = m
        c.save
---
SELECT "towns".* FROM "towns" WHERE "towns"."name" = 'SFO' LIMIT 1
SELECT "towns".* FROM "towns" WHERE "towns"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "mayors" SET "name" = ?, "updated_at" = ? WHERE "mayors"."id" = 3  [["name", nil], ["updated_at", Sun, 15 Jun 2014 00:18:07 UTC +00:00]]